locationMaisons/app/Filters/UserStatusFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        if ($session->has('idUtilisateur')) {
            $userModel = new UserModel();
            $user = $userModel->find($session->get('idUtilisateur'));
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`idUtilisateur` = '26'