locationMaisons/app/Controllers/IndisponibiliteController.php

    public function store()
{
    $data = $this->request->getPost();

    // Validation avec le modèle (tu as déjà défini les règles dans ton modèle IndisponibiliteModel)
    if (!$this->indisponibiliteModel->validate($data)) {
        // La validation a échoué, récupérer les erreurs
        $errors = $this->indisponibiliteModel->errors();

        // Rediriger vers le formulaire en gardant les données saisies + erreurs
        return redirect()->back()->withInput()->with('errors', $errors);
    }

    // Vérification complémentaire dateDebut < dateFin
    if (strtotime($data['dateDebut']) > strtotime($data['dateFin'])) {
        return redirect()->back()->withInput()->with('error', 'La date de début doit être antérieure à la date de fin.');
    }

    // Enregistrement dans la base
    $this->indisponibiliteModel->insert($data);
---
INSERT INTO `Indisponibilite` (`idMaison`, `motif`, `dateDebut`, `dateFin`) VALUES ('24', 'test', '2025-05-24', '2025-05-25')