locationMaisons/app/Controllers/IndisponibiliteController.php

    public function index($idMaison)
    {
        // On récupère la maison (facultatif si tu ne l'utilises pas dans la vue)
        $guesthouse = $this->guesthouseModel->find($idMaison);

        // On récupère les indisponibilités associées à cette maison
        $indisponibilites = $this->indisponibiliteModel
            ->where('idMaison', $idMaison)
            ->findAll();
---
SELECT *
FROM `Indisponibilite`
WHERE `idMaison` = '24'

    public function create($idMaison)
    {
        // Charger les modèles nécessaires
        $guesthouseModel = new GuesthouseModel();
        $indisponibiliteModel = new IndisponibiliteModel();

        // Récupérer les informations de la maison
        $guesthouse = $guesthouseModel->find($idMaison);
        if (!$guesthouse) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Maison non trouvée");
        }

        // Récupérer les indisponibilités associées à cette maison
        $indisponibilites = $indisponibiliteModel->where('idMaison', $idMaison)->findAll();
---
SELECT *
FROM `Indisponibilite`
WHERE `idMaison` = '24'

    public function store()
    {
        $data = $this->request->getPost();

        $this->indisponibiliteModel->insert([
            'idMaison' => $data['idMaison'],
            'motif'    => $data['motif'],
            'dateDebut' => $data['dateDebut'],
            'dateFin'   => $data['dateFin'],
        ]);
---
INSERT INTO `Indisponibilite` (`idMaison`, `motif`, `dateDebut`, `dateFin`) VALUES ('24', 'Séjour personnel', '2025-05-08', '2225-06-08')

    public function delete($idIndisponibilite)
{
    $indisponibiliteModel = new IndisponibiliteModel();

    // Vérifier si l'indisponibilité existe
    $indisponibilite = $indisponibiliteModel->find($idIndisponibilite);

    if ($indisponibilite) {
        // Suppression de l'indisponibilité
        $indisponibiliteModel->delete($idIndisponibilite);
---
SELECT *
FROM `Indisponibilite`
WHERE `Indisponibilite`.`idIndisponibilite` = '6'
DELETE FROM `Indisponibilite`
WHERE `idIndisponibilite` IN ('6')