locationMaisons/app/Controllers/SaisonController.php

INSERT INTO `Saison` (`annee`, `dateDebut`, `dateFin`, `idMaison`, `prix`, `typeSaison`)
VALUES (2025,'2025-07-01','2025-08-31','24',120,'Haute'), (2025,'2025-05-01','2025-06-30','24',90,'Moyenne'), (2025,'2025-09-01','2025-10-15','24',90,'Moyenne'), (2025,'2025-01-01','2025-04-30','24',60,'Basse'), (2025,'2025-10-16','2025-12-31','24',60,'Basse'), (2026,'2026-07-01','2026-08-31','24',125,'Haute'), (2026,'2026-05-01','2026-06-30','24',95,'Moyenne'), (2026,'2026-09-01','2026-10-15','24',95,'Moyenne'), (2026,'2026-01-01','2026-04-30','24',65,'Basse'), (2026,'2026-10-16','2026-12-31','24',65,'Basse')
---
                ];
            }

            $saisonModel->insertBatch($saisonsAInserer);