locationMaisons/app/Controllers/UserController.php

    public function allUsers() {
        $userModel = new UserModel();
        $users = $userModel->select('idUtilisateur, nom, prenom, role')->findAll();
---
SELECT `idUtilisateur`, `nom`, `prenom`, `role`
FROM `utilisateur`