locationMaisons/app/Controllers/UserController.php

    public function showUserInfo()
    {
        if (!session()->has('idUtilisateur')) {
            return redirect()->to('se_connecter')->with('error', 'Veuillez vous connecter.');
        }

        $user = (new UserModel())->find(session()->get('idUtilisateur'));
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`idUtilisateur` = '26'

    public function allUsers()
    {
        $users = (new UserModel())->select('idUtilisateur, nom, prenom, role, photo, status')->findAll();
---
SELECT `idUtilisateur`, `nom`, `prenom`, `role`, `photo`, `status`
FROM `utilisateur`